Documents/РеализацияМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>РеализацияМатериалов</Name>
			<BasedOn>
				<xr:Item>Document.ИнвентаризацияМатериалов</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаХранения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccountingRegisters/Управленческий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<AccountingRegister>
		<Properties>
			<Name>Управленческий</Name>
			<ChartOfAccounts>ChartOfAccounts.Управленческий</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Управленческий.AccountingFlag.Количественный</AccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Enums/ВидыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>ВидыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Комплект</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Материал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/РеализацияМатериалов/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.Управленческий.Записать();
	
	Для каждого Строка Из СписокНоменклатуры Цикл
	
		Проводка 							= Движения.Управленческий.Добавить();
		Проводка.Подразделение 	= Подразделение;
		Проводка.Период 				= Дата;
		Проводка.СчетКт 				= ПланыСчетов.Управленческий.ВзаиморасчетыСПодразделениями;
		Проводка.КоличествоКт 		= Строка.Количество;
		Проводка.Сумма 				= Строка.Сумма;
		Проводка.Регистратор 		= Ссылка;
	
	КонецЦикла;
	
	// установить блокировку
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МИНИМУМ(РеализацияМатериаловСписокНоменклатуры.НомерСтроки) КАК НомерСтроки,
	|	РеализацияМатериаловСписокНоменклатуры.Номенклатура,
	|	РеализацияМатериаловСписокНоменклатуры.ЕдиницаХранения,
	|	СУММА(РеализацияМатериаловСписокНоменклатуры.Количество) КАК Количество,
	|	СУММА(РеализацияМатериаловСписокНоменклатуры.Сумма) КАК Сумма
	|ПОМЕСТИТЬ тчДок
	|ИЗ
	|	Документ.РеализацияМатериалов.СписокНоменклатуры КАК РеализацияМатериаловСписокНоменклатуры
	|ГДЕ
	|	РеализацияМатериаловСписокНоменклатуры.Ссылка = &Ссылка
	|	И (РеализацияМатериаловСписокНоменклатуры.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Материал)
	|			ИЛИ РеализацияМатериаловСписокНоменклатуры.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Комплект))
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияМатериаловСписокНоменклатуры.Номенклатура,
	|	РеализацияМатериаловСписокНоменклатуры.ЕдиницаХранения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тчДок.НомерСтроки,
	|	тчДок.Номенклатура,
	|	тчДок.ЕдиницаХранения,
	|	тчДок.Количество,
	|	тчДок.Сумма КАК Сумма,
	|	ЕСТЬNULL(УправленческийОстатки.СуммаОстаток, 0) КАК СтоимостьОстаток,
	|	ЕСТЬNULL(УправленческийОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток
	|ИЗ
	|	тчДок КАК тчДок
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Управленческий.Остатки(
	|				&МоментВремени,
	|				,
	|				,
	|				Субконто1 = &Склад
	|					И Субконто2 В
	|						(ВЫБРАТЬ
	|							т.Номенклатура
	|						ИЗ
	|							тчДок КАК т)) КАК УправленческийОстатки
	|		ПО тчДок.Номенклатура = УправленческийОстатки.Субконто2
	|ИТОГИ ПО
	|	ОБЩИЕ,
	|	Сумма";
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	// списываем материал со склада
	Пока Выборка.Следующий() Цикл
		
		СуммаПоДокументу = Выборка.Сумма;
		
		
		//Если Выборка.ТипЗаписи() = ТипЗаписиЗапроса.ОбщийИтог Тогда
		//	СуммаПоДокументу = Выборка.Сумма;
		//	Продолжить;
		//КонецЕсли;
		//
		//Если Выборка.Количество > Выборка.КоличествоОстаток Тогда
		//	
		//	Сообщение = Новый СообщениеПользователю;
		//	Сообщение.Текст ="На складе """ + Склад + """ недостаточно свободного товара """ + Выборка.Номенклатура + 
		//	""". Из требуемых " + Выборка.Количество + " есть только " + Выборка.КоличествоОстаток;
		//	Сообщение.Поле = "СписокНоменклатуры[" + (Выборка.НомерСтроки-1) + "].Количество";
		//	Сообщение.УстановитьДанные(ЭтотОбъект);
		//	Сообщение.Сообщить();
		//	
		//	Отказ = Истина;
		//	Продолжить;
		//КонецЕсли;
		//
		//Если Выборка.КоличествоОстаток <> 0 Тогда
		//	Себестоимость = Выборка.Количество / Выборка.КоличествоОстаток * Выборка.СтоимостьОстаток;
		//Иначе
		//	Себестоимость = 0;
		//КонецЕсли;
		//
		//Проводки = Движения.МатериалыНаСкладах.ДобавитьРасход();
		//Проводки.Период = Дата;
		//Проводки.Номенклатура = Выборка.Номенклатура;
		//Проводки.ЕдиницаХранения = Выборка.ЕдиницаХранения;
		//Проводки.Склад = Склад;
		//Проводки.Количество = Выборка.Количество;
		//Проводки.Стоимость = Себестоимость;
		//
		//
		//// увеличим расходы
		//Проводки = Движения.ОборотыПоСтатьям.Добавить();
		//Проводки.Период = Дата;
		//Проводки.Подразделение = Подразделение;
		//Проводки.Статья = Выборка.Номенклатура.СтатьяРасхода;
		//Проводки.Факт = Себестоимость;

	КонецЦикла;
	
	//// приходуем долг на контрагента
	//Проводки = Движения.ВзаиморасчетыСКонтрагентами.ДобавитьПриход();
	//Проводки.Период = Дата;
	//Проводки.Подразделение = Подразделение;
	//Проводки.Контрагент = Контрагент;
	//Проводки.Сумма = СуммаДокумента;
	//
	//// увеличим обороты по статьям
	//Проводки = Движения.ОборотыПоСтатьям.Добавить();
	//Проводки.Период = Дата;
	//Проводки.Подразделение = Подразделение;
	//Проводки.Статья = Справочники.Статьи.Выручка;
	//Проводки.Факт = СуммаДокумента;
	//Проводки.Касса = СуммаДокумента;
	//
	//Проводки = Движения.ОборотыПоСтатьям.Добавить();
	//Проводки.Период = Дата;
	//Проводки.Подразделение = Подразделение;
	//Проводки.Статья = Справочники.Статьи.РеализацияМатериалов;
	//Проводки.Факт = СуммаДокумента;	
	//Проводки.Касса = СуммаДокумента;
	//
	//Если РеализацияВДолг Тогда
	//	// реализовать проверку на кредитный лимит
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ISNULL(ВзаиморасчетыСКонтрагентамиОстатки.СуммаОстаток, 0) КАК СуммаОстаток
	//	|ИЗ
	//	|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(
	//	|			&Период,
	//	|			Подразделение = &Подразделение
	//	|				И Контрагент = &Контрагент) КАК ВзаиморасчетыСКонтрагентамиОстатки";
	//	
	//	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	//	Запрос.УстановитьПараметр("Период", МоментВремени());
	//	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	//	
	//	Результат = Запрос.Выполнить();
	//	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//		Если ВыборкаДетальныеЗаписи.СуммаОстаток + СуммаДокумента > Контрагент.КредитныйЛимит Тогда
	//			Отказ = Истина;
	//			Сообщение = Новый СообщениеПользователю;
	//			Сообщение.Текст = "Превышен кредитный лимит";
	//			Сообщение.Поле = "Контрагент";
	//			Сообщение.УстановитьДанные(ЭтотОбъект);
	//			Сообщение.Сообщить();
	//		КонецЕсли;
	//	КонецЦикла;
	//Иначе
	//	// приходуем деньги на автора
	//	Проводки = Движения.ОперационнаяКасса.ДобавитьПриход();
	//	Проводки.Период = Дата;
	//	Проводки.Подразделение = Подразделение;
	//	Проводки.Сотрудник = Автор.ФизЛицо;
	//	Проводки.Сумма = СуммаДокумента;
	//	
	//	// спишем долг с контрагента
	//	Проводки = Движения.ВзаиморасчетыСКонтрагентами.ДобавитьРасход();
	//	Проводки.Период = Дата;
	//	Проводки.Подразделение = Подразделение;
	//	Проводки.Контрагент = Контрагент;
	//	Проводки.Сумма = СуммаДокумента;
	//КонецЕсли;
	//
	//Если не Отказ Тогда
	//	Движения.ВзаиморасчетыСКонтрагентами.Записывать = Истина;
	//	Движения.МатериалыНаСкладах.Записывать = Истина;
	//	Движения.ОперационнаяКасса.Записывать = Истина;
	//	Движения.ОборотыПоСтатьям.Записывать = Истина;
	//КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	СуммаДокумента = СписокНоменклатуры.Итог("Сумма");
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	// очистим контрагента
	// чтобы пользователь его выбрал
	// и обновились отображения долга
	// и заново заполнились скидки
	Контрагент = Справочники.Контрагенты.ПустаяСсылка();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	
	
КонецПроцедуры
